source/blog/2018-02-28-tensorflow.org
#+TITLE: tensorflow
#+DATE: 2018-02-28
#+SETUPFILE: ~/blog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: tensorflow
#+JEKYLL_TAGS: python
#+JEKYLL_PUBLISHED: true

* Tensorflow 算法的一般流程
** 导入或生成样本数据集
所有的机器学习算法都依赖于样本数据集（既可以是生成的样本数据集，也可以是外部公开的样本数据集）
** 转换和归一化数据
当输入样本数据集不符合Tensorflow 期望的形状或数据集的维度、类型等不符合适用机器学习算法的要求时，需要进行数据转换
** 划分样本数据集为训练样本集、测试样本集和验证样本集
一般要求训练样本集和测试样本集是不同的数据集。另外，许多机器学习算法要求超参数调优，所以需要验证样本集来决定最优的超参数
** 设置机器学习参数（超参数）
迭代次数，学习率等
** 初始化变量和占位符
在求解最优化过程中（最小化损失函数），tensorflow 通过占位符获取数据，并调整变量和权重（或偏差）
** 定义模型结构
** 声明损失函数
定义模型以后需要声明损失函数评估输出结果
** 初始化模型和训练模型
tensorflow 创建计算图实例，通过占位符赋值，维护变量的状态信息
** 评估机器学习模型
构建计算图，并训练机器模型后，需要评估机器学习模型对新样本数据集的效果（是否过拟合或欠拟合）
** 调优超参数
通过调整不同的超参数来重复训练模型，并用验证样本集来评估机器学习模型
** 发布或预测结果
所有的机器学习模型一旦训练好，最后都用来预测未知的数据。
